{
    "title" : "Things I don't miss about work",
	"version" : "1.0.2",
    "daysSinceRetirement": 80,
    "commuting" : [
        "waste of time",
        "waste of resources",
        "I hate fucking sitting in fucking traffic"
    ],
    "agile" : [
        "8AM scrums",
        "8AM scrums that interfere with my workouts",
        "it's really waterfall but we're calling it agile so we can make you do sprints",
        "agile sucking all the joy out of programming"
    ],
    "reviews" : [
        "peer reviews are the worst",
        { "selfAssessments" : [
            "just kill me now",
            "why do you make me do this every fucking year?",
            "of course I'm always going to give myself exceptional ratings, I'd be stupid not to"
        ]},
        "stop with the bullshit and just tell me how much of a raise I'm getting (or not)",
        "tell me the percentage and not the dollar amount and the percentage better be more than inflation",
        { "performanceMetrics" : [
            "KPIs",
            "MBOs",
			"OKRs",
            "V2MOMs"
        ]}
    ],
    "mentalHealth" : [
        "impostor syndrome",
        "burnout",
        "having to pretend to care all the time",
		"it's just a job",
		"bosses don't really like it when you say 'work is the second most important thing in my life'",
        "companies who claim they care about the mental health of their employees when it's actually just lip-service to make themselves feel better about themselves"
    ],
    "annoyingCorporateSpeak" : [
        "let's drill down into that",
        "let's double-click on that",
        "turning an aircraft carrier (or any other war metaphor)",
		"You go to war with the army you have, not the army you might want or wish to have at a later time.",
		"right-sizing the corporatation",
		"taking the ball into the endzone (or any other sports metaphor)",
        { "SalesforceSpecificCorporateSpeak" : [
            "Ohana",
            "Employee Success",
            "We prefer the term 'Drinking our own champagne!' (vs. 'Eating our own dog food')",
			"well, it's a journey (meaning 'We don't effing know')"
        ]}  
    ],
	"mandatoryFunEvents" : [
		"the 'mandatory' part is rarely explicit, but it's certainly implied",
		"'Fun' needs to always be in air quotes",
		"usually not in a place you would voluntarily go yourself",
		"I fucking hate fucking Las Vegas",
		"company photographers on hand to capture all the 'fun' so it can be plastered all over the office walls",
		"lots of free booze but avoid like it's plutonium because you don't want to get plastered and become momentarily honest",
		"awkward small talk",
		"awkward small talk with senior management trying to 'get real' with the minions",
		"colleagues desperately trying to suck up to the senior management",
		"never get on a boat - you're trapped for the next 2-5 hours with no chance for escape"
	],
	"interviewing" : [
		"tell me about your problem areas",
		"tell me something you're passionate about (well, it ain't work!)",
		"we can't ask you what you're currently earning, so just tell us your 'salary expectations'",
		"that one guy in the group interview who just wants to shoot you down to assert his alpha chimp",
		"we're looking for a rock star",
		"we're looking for a java/javascript/python/database NINJA!"
	],
	"generalAnnoyances" : [
		"yutzes on the West Coast that schedule meetings for 4:30PM in my timezone",
		"'unlimited vacation' really means 'we don't want to carry all that reimbursable salary on our books from year-to-year",
		"also 'unlimited vacation' doesn't actually literally mean 'unlimited' - it often means 'less than you had before because if you take too much, you sure look like you're slacking compared to your peers'"
	]
}